{"id":949,"date":"2022-09-05T15:48:31","date_gmt":"2022-09-05T15:48:31","guid":{"rendered":"https:\/\/wpsmartnft.com\/?post_type=docs&#038;p=949"},"modified":"2022-09-15T11:00:34","modified_gmt":"2022-09-15T11:00:34","slug":"terminology","status":"publish","type":"docs","link":"https:\/\/wpsmartnft.com\/docs\/terminology\/","title":{"rendered":"Definitions"},"content":{"rendered":"\n<h5 class=\"wp-block-heading\">What is blockchain?<\/h5>\n\n\n\n<p>At its core, a&nbsp;<strong>blockchain<\/strong>&nbsp;is a database shared across multiple computers.<\/p>\n\n\n\n<p>Triggers for the database operations are called&nbsp;<strong>transactions<\/strong>&nbsp;The data contained in a transaction specifies the operation to be performed.<\/p>\n\n\n\n<p>In an&nbsp;<strong>account-based<\/strong>&nbsp;blockchain, the validity of a new transaction is checked against a database of user accounts. An account is a portion of the database identified by the account&nbsp;<strong>address<\/strong>. This is opposed to&nbsp;<strong>UTXO-based<\/strong>&nbsp;blockchains (such as Bitcoin, see&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Bitcoin\" target=\"_blank\" rel=\"noreferrer noopener\">Wikipedia page<\/a>), where there is no concept of account and the validity of a transaction is based on a database of referenced past transactions.<\/p>\n\n\n\n<p>The cost of processing the transaction and updating the blockchain is specified in the transaction fee and paid using&nbsp;<strong>tokens<\/strong>.<\/p>\n\n\n\n<p>Transactions are shared among nodes connected in a&nbsp;<strong>P2P network<\/strong>&nbsp;and are grouped together into&nbsp;<strong>blocks<\/strong>.<\/p>\n\n\n\n<p>The validity of a block (and all transactions within it) is determined against the accounts state.<\/p>\n\n\n\n<p>The&nbsp;<strong>consensus protocol<\/strong>&nbsp;specifies who has the right to&nbsp;<strong>forge<\/strong>&nbsp;a new block and how agreement on blocks is reached. After the block has been forged, it is added to the blockchain, and all state changes induced by the block transactions are applied.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h5 class=\"wp-block-heading\">What is NFT<\/h5>\n\n\n\n<p>NFT stands for non-fungible token. Ethereum.org explains it as: <strong>NFTs are tokens that we can use to represent ownership of unique items<\/strong>. They let us tokenize things like art, collectibles, and even real estate.<\/p>\n\n\n\n<div class=\"wp-block-coblocks-alert is-style-success\" aria-label=\"Alert section of type success\"><p class=\"wp-block-coblocks-alert__text\">Here is an overview of NFT in a blockchain application\/plugin that have the following functionality<\/p><\/div>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"829\" src=\"https:\/\/wpsmartnft.com\/wp-content\/uploads\/2022\/09\/nft-overview-1.png\" alt=\"\" class=\"wp-image-2123\" srcset=\"https:\/\/wpsmartnft.com\/wp-content\/uploads\/2022\/09\/nft-overview-1.png 1024w, https:\/\/wpsmartnft.com\/wp-content\/uploads\/2022\/09\/nft-overview-1-300x243.png 300w, https:\/\/wpsmartnft.com\/wp-content\/uploads\/2022\/09\/nft-overview-1-600x486.png 600w, https:\/\/wpsmartnft.com\/wp-content\/uploads\/2022\/09\/nft-overview-1-768x622.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<h5 class=\"wp-block-heading\">What are Smart Contracts?<\/h5>\n\n\n\n<p>Smart contracts are simply programs stored on a blockchain that run when predetermined conditions are met. They typically are used to automate the execution of an agreement so that all participants can be immediately certain of the outcome, without any intermediary’s involvement or time loss. They can also automate a workflow, triggering the next action when conditions are met.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">How Smart Contracts work?<\/h5>\n\n\n\n<p>Smart contracts work by following simple “if\/when…then…” statements that are written into code on a blockchain. A network of computers executes the actions when predetermined conditions have been met and verified. These actions could include releasing funds to the appropriate parties, registering a vehicle, sending notifications, or issuing a ticket. The blockchain is then updated when the transaction is completed. That means the transaction cannot be changed, and only parties who have been granted permission can see the results.<\/p>\n\n\n\n<div class=\"wp-block-coblocks-alert\" aria-label=\"Alert section\"><p class=\"wp-block-coblocks-alert__text\"><strong>Remember!<\/strong> Smart contracts are written in solidity language. It is compiled as json file and this json file is used to deploy the contracts. Smart contracts are deployed on a network i.e: Ethereum, Polygon, Soalan etc. Then this smart contract store data about NFT.<\/p><\/div>\n\n\n\n<p><\/p>\n\n\n\n<p>Within a smart contract, there can be as many stipulations as needed to satisfy the participants that the task will be completed satisfactorily. To establish the terms, participants must determine how transactions and their data are represented on the blockchain, agree on the “if\/when&#8230;then…” rules that govern those transactions, explore all possible exceptions, and define a framework for resolving disputes.<\/p>\n\n\n\n<p>Then the smart contract can be programmed by a developer – although increasingly, organizations that use blockchain for business provide templates, web interfaces, and other online tools to simplify structuring smart contracts.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h5 class=\"wp-block-heading\">Minting an NFT<\/h5>\n\n\n\n<p>Minting an NFT means creating and listing an NFT on the blockchain via Smart Contract. When an NFT is created on a blockchain and PUT on sale it means anyone can purchase that NFT by paying its <strong>price + gas<\/strong> fee by his wallet. For minting an NFT you need to pay Gas Fees.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h5 class=\"wp-block-heading\">Gas Fee<\/h5>\n\n\n\n<div class=\"wp-block-coblocks-alert is-style-success\" aria-label=\"Alert section of type success\"><p class=\"wp-block-coblocks-alert__text\"><strong>💡&nbsp;<\/strong>Gas fee is the minimum charge cut by solidity functions during some actions. <\/p><\/div>\n\n\n\n<p><\/p>\n\n\n\n<p>A gas fee is&nbsp;<strong>a<\/strong> term given to transaction fees on the<strong> blockchain network<\/strong>(i.e: Ethereum, Polygon). According to Ethereum&#8217;s developer pages, gas is “the fuel that allows the [Ethereum network] to operate, in the same way, that a car needs gasoline to run.”<\/p>\n\n\n\n<h5 class=\"wp-block-heading\">What is a transaction on the blockchain?<\/h5>\n\n\n\n<p>A transaction is a transfer of value on the blockchain. In very simple terms, a transaction is when one person gives a designated amount of cryptocurrency they own to another person.&nbsp;<\/p>\n\n\n\n<p>To perform transactions on the blockchain, you need a&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/www.ledger.com\/academy\/basic-basics\/owning-and-using-it\/how-to-keep-your-crypto-safe\" target=\"_blank\">wallet<\/a>, a program linked with the blockchain to which only you have access, that keeps track of the crypto you own and allows you to transact with it. Each wallet is protected by a special cryptographic method that uses a unique pair of distinct but connected keys: a private and a public key.<\/p>\n\n\n\n<p>A public key, also known as the address, is a series of letters and numbers that a user must share in order to receive funds. In contrast, a private key must be kept secret, much like your bank card pin number, as it authorizes the spending of any funds received by the associated public key.<\/p>\n\n\n\n<p>With their wallet, a user (whoever has the&nbsp;<a href=\"https:\/\/www.ledger.com\/academy\/basic-basics\/owning-and-using-it\/what-is-a-private-key\" target=\"_blank\" rel=\"noreferrer noopener\">private key<\/a>) can authorize or sign transactions and thereby transfer value to a new owner. The transaction is then broadcast to the network to be included in the blockchain.<\/p>\n\n\n\n<div class=\"wp-block-coblocks-alert is-style-warning\" aria-label=\"Alert section of type warning\"><p class=\"wp-block-coblocks-alert__title\"><strong>Important!<\/strong><\/p><p class=\"wp-block-coblocks-alert__text\">Transactions have hash codes that can be checked on different network scanner sites.For example, you can verify Ethereum transaction hash on <a href=\"https:\/\/etherscan.io\/\" target=\"_blank\" rel=\"noreferrer noopener\">https:\/\/etherscan.io\/<\/a><\/p><\/div>\n\n\n\n<p><\/p>\n\n\n\n<h5 class=\"wp-block-heading\">What is token standards?<\/h5>\n\n\n\n<p>A token standard defines the smart contract and features that the token issued by it has. There are many different standards on different blockchains. The simplest categorization would be between fungible and non-fungible tokens.<\/p>\n\n\n\n<p>Over time, Ethereum has gained more and more popularity and now most NFTs are issued on this blockchain. Ethereum token standards start with the abbreviation ‘ERC’ (Ethereum Request for Comments).<\/p>\n\n\n\n<div class=\"wp-block-coblocks-alert\" aria-label=\"Alert section\"><p class=\"wp-block-coblocks-alert__text\"><strong>💡<\/strong>Smart NFT currently Supports ERC-721 and BEP-721 tokens<\/p><\/div>\n\n\n\n<p><\/p>\n\n\n\n<h5 class=\"wp-block-heading\">The ERC standards<\/h5>\n\n\n\n<ul>\n<li>ERC-721 – non-fungible tokens<\/li>\n\n\n\n<li>ERC-223 – much like ERC-20 but with a feature that ensures the tokens are only sent to compatible addresses. This prevents loss of access to the tokens since they cannot be retrieved from incompatible addresses.<\/li>\n\n\n\n<li>ERC-827 – allows the approval of fungible token transfers so the tokens can be spent by an on-chain third party.<\/li>\n\n\n\n<li>ERC-777 – an improvement on ERC-20. Users can send tokens on behalf of different addresses.<\/li>\n\n\n\n<li>ERC-1155 – a smart contract that allows users to manage Ethereum tokens of many types. It can contain ERC-20 or ERC-721 tokens and it works for all types of assets: fungible and non-fungible.<\/li>\n\n\n\n<li>ERC-1137 – a token standard designed for recurring payments. It works well for subscriptions requiring payments at certain intervals.<\/li>\n\n\n\n<li>ERC-998 – a smart contract that allows users to merge several NFTs into one NFT.<\/li>\n\n\n\n<li>ERC-875 – a smart contract that allows users to transfer several NFTs in a single transaction.<\/li>\n\n\n\n<li>ERC-865 – a smart contract that allows users to pay for a transaction with tokens instead of gas.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>What is blockchain? At its core, a&nbsp;blockchain&nbsp;is a database shared across multiple computers. Triggers for the database operations are called&nbsp;transactions&nbsp;The data contained in a transaction specifies the operation to be performed. In an&nbsp;account-based&nbsp;blockchain, the validity of a new transaction is checked against a database of user accounts. An account is a portion of the database identified by the account&nbsp;address. This is opposed to&nbsp;UTXO-based&nbsp;blockchains (such as Bitcoin, see&nbsp;Wikipedia page), where there is no concept of account and the validity of a transaction is based on a database of referenced past transactions. The cost of processing the transaction and updating the blockchain…<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","template":"","meta":{"_coblocks_attr":"","_coblocks_dimensions":"","_coblocks_responsive_height":"","_coblocks_accordion_ie_support":"","_uag_custom_page_level_css":""},"doc_category":[7],"doc_tag":[],"blocksy_meta":{"styles_descriptor":{"styles":{"desktop":"","tablet":"","mobile":""},"google_fonts":[],"version":5}},"uagb_featured_image_src":{"full":false,"thumbnail":false,"medium":false,"medium_large":false,"large":false,"1536x1536":false,"2048x2048":false},"uagb_author_info":{"display_name":"smartnft","author_link":"https:\/\/wpsmartnft.com\/author\/smartnft\/"},"uagb_comment_info":0,"uagb_excerpt":"What is blockchain? At its core, a&nbsp;blockchain&nbsp;is a database shared across multiple computers. Triggers for the database operations are called&nbsp;transactions&nbsp;The data contained in a transaction specifies the operation to be performed. In an&nbsp;account-based&nbsp;blockchain, the validity of a new transaction is checked against a database of user accounts. An account is a portion of the database&hellip;","_links":{"self":[{"href":"https:\/\/wpsmartnft.com\/wp-json\/wp\/v2\/docs\/949"}],"collection":[{"href":"https:\/\/wpsmartnft.com\/wp-json\/wp\/v2\/docs"}],"about":[{"href":"https:\/\/wpsmartnft.com\/wp-json\/wp\/v2\/types\/docs"}],"author":[{"embeddable":true,"href":"https:\/\/wpsmartnft.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/wpsmartnft.com\/wp-json\/wp\/v2\/comments?post=949"}],"version-history":[{"count":0,"href":"https:\/\/wpsmartnft.com\/wp-json\/wp\/v2\/docs\/949\/revisions"}],"wp:attachment":[{"href":"https:\/\/wpsmartnft.com\/wp-json\/wp\/v2\/media?parent=949"}],"wp:term":[{"taxonomy":"doc_category","embeddable":true,"href":"https:\/\/wpsmartnft.com\/wp-json\/wp\/v2\/doc_category?post=949"},{"taxonomy":"doc_tag","embeddable":true,"href":"https:\/\/wpsmartnft.com\/wp-json\/wp\/v2\/doc_tag?post=949"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}